OpenFOAM-v2412/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // cyclic boundaries between film patches
    "(cube[0-9][0-9]_side[0-9]_to_cube[0-9][0-9]_side[0-9])"
    {
        type            nonuniformTransformCyclic;
    }

    // top film surface
    "(.*top)"
    {
        type            slip;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
        type            slip;
    }

    // floor sides
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
